<b>Aggregation,GroupBy,Functions,Merging</b>

In [1]:
#importing libriary
import pandas as pd

In [3]:
#loading data
df_imdb = pd.read_csv('data/IMDB_Movie.csv')
df_imdb.head()

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0

In [6]:
# select movie_title and duration columns
df_imdb[['movie_title','duration']]

                                            movie_title  duration
0                                             Avatar \t     178.0
1             Pirates of the Caribbean: At World's End      169.0
2                                              Spectre      148.0
3                                The Dark Knight Rises      164.0
4     Star Wars: Episode VII - The Force Awakens    ...       NaN
...                                                 ...       ...
5038                           Signed Sealed Delivered       87.0
5039                         The Following                   43.0
5040                              A Plague So Pleasant       76.0
5041                                  Shanghai Calling      100.0
5042                                 My Date with Drew       90.0

[5043 rows x 2 columns]

<b>Aggregations</b>

In [7]:
# counting no of movie_title using count function
df_imdb['movie_title'].count()

5043

In [8]:
# total duration for all movie
df_imdb['duration'].sum()

539007.0

In [9]:
# min, max, mean
print(df_imdb['duration'].min())
print(df_imdb['duration'].max())
print(df_imdb['duration'].mean())

7.0
511.0
107.2010739856802

<b>GroupBy</b>

In [13]:
df_imdb1 = pd.read_csv('data/IMDB_Movie_Facebook_Like.csv')
df_imdb1.head()

       director_name             movie_title  movie_facebook_likes
0  Christopher Nolan        The Dark Knight                  37000
1      James Cameron                 Avatar                  33000
2  Quentin Tarantino       Django Unchained                 199000
3  Christopher Nolan  The Dark Knight Rises                 164000
4  Quentin Tarantino   Inglourious Basterds                  42000

In [15]:
# groupby on column director_name
df_imdb1.groupby('director_name')
df_imdb1.groupby('director_name').sum()

                   movie_facebook_likes
director_name
Christopher Nolan                201000
James Cameron                     59000
Quentin Tarantino                241000

In [16]:
# sort follow facebook likes and find director with most social network facebook
df_imdb1.groupby('director_name').sum().sort_values(by='movie_facebook_likes')

                   movie_facebook_likes
director_name
James Cameron                     59000
Christopher Nolan                201000
Quentin Tarantino                241000

<b>functions</b>

In [17]:
df_imdb2 = pd.read_csv('data/IMDB_Movie_Apply.csv')
df_imdb2.head()

,movie_title,gross,movie_imdb_link
0,Avatar \t,760505847.0,http://www.imdb.com/title/tt0499549/?ref_=fn_t...
1,Pirates of the Caribbean: At World's End,309404152.0,http://www.imdb.com/title/tt0449088/?ref_=fn_t...
2,Spectre,200074175.0,http://www.imdb.com/title/tt2379713/?ref_=fn_t...
3,The Dark Knight Rises,448130642.0,http://www.imdb.com/title/tt1345836/?ref_=fn_t...
4,Star Wars: Episode VII - The Force Awakens ...,NaN,http://www.imdb.com/title/tt5289954/?ref_=fn_t...

In [19]:
df_imdb2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5043 entries, 0 to 5042
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_title      5043 non-null   object
 1   gross            4159 non-null   float64
 2   movie_imdb_link  5043 non-null   object
dtypes: float64(1), object(2)
memory usage: 118.3+ KB

In [22]:
#function to convert to million
def to_million(g):
    return g/1000000

# change gross to million unit for easy of read
df_imdb['gross'].apply(to_million).head()

0    760.505847
1    309.404152
2    200.074175
3    448.130642
4           NaN
Name: gross, dtype: float64

In [24]:
#function for shorten the link
def shorten(l):
    return l.replace('http://www.imdb.com/title/','')#(this blank space is replacing the link)

df_imdb['movie_imdb_link'].apply(shorten).head()

0    tt0499549/?ref_=fn_tt_tt_1
1    tt0449088/?ref_=fn_tt_tt_1
2    tt2379713/?ref_=fn_tt_tt_1
3    tt1345836/?ref_=fn_tt_tt_1
4    tt5289954/?ref_=fn_tt_tt_1
Name: movie_imdb_link, dtype: object

<b>Merging</b>

In [26]:
#load customer table
df_customers = pd.read_csv('data/customers.csv')
df_customers.head()

   customer_id first_name   last_name
0            1     George  Washington
1            2       John       Adams
2            3     Thomas   Jefferson
3            4      James     Madison
4            5      James      Monroe

In [27]:
# load and show orders table 'orders.csv'
df_orders = pd.read_csv('data/orders.csv')
df_orders.head()

   order_id  order_date  amount  customer_id
0         1  07/04/1776  234.56            1
1         2  03/14/1760   78.50            3
2         3  05/23/1784  124.00            2
3         4  09/03/1790   65.50            3
4         5  07/21/1795   25.50           10

In [29]:
# merge two tables base on same column 'customer_id'
df_merge = pd.merge(left=df_orders,right=df_customers,on='customer_id')
df_merge.head()

   order_id  order_date  amount  customer_id first_name   last_name
0         1  07/04/1776  234.56            1     George  Washington
1         2  03/14/1760   78.50            3     Thomas   Jefferson
2         4  09/03/1790   65.50            3     Thomas   Jefferson
3         3  05/23/1784  124.00            2       John       Adams

In [30]:
df_merge.groupby('customer_id').sum()

             order_id  amount
customer_id
1                   1  234.56
2                   3  124.00
3                   6  144.00